notes/dec4/dec4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-12 Tue 17:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interpreting probabilistic programs</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Interpreting probabilistic programs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf19c85b">1. Overview</a></li>
<li><a href="#orgacc8eb7">2. The meanings of λ-calculus types</a></li>
<li><a href="#org5e0135a">3. The meaning of λ-calculus terms</a>
<ul>
<li><a href="#org1661078">3.1. Constants</a></li>
<li><a href="#org2a60a84">3.2. Monadic constructors</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf19c85b" class="outline-2">
<h2 id="orgf19c85b"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
In <a href="../nov29/nov29.html">the previous notes</a>, we gave a syntactic encoding in the λ-calculus of our
probabilistic programming DSL. This set of notes sets the program for
interpreting this DSL into Haskell, using our theorem prover. Thus it extends
the system we developed <a href="../nov20/nov20.html">here</a>.
</p>

<p>
To extend this interpretation scheme to our DSL, we should update our map from
λ-calculus types to Haskell types, as well as our map from terms to Haskell
functions.
</p>
</div>
</div>

<div id="outline-container-orgacc8eb7" class="outline-2">
<h2 id="orgacc8eb7"><span class="section-number-2">2.</span> The meanings of λ-calculus types</h2>
<div class="outline-text-2" id="text-2">
<p>
We can update our map <code>Domain</code> from λ-calculus types to Haskell types as
follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #fb4933;">family</span> <span style="color: #d3869b;">Domain</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Domain</span> <span style="color: #d3869b;">E</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">FOL.Term</span>
  <span style="color: #d3869b;">Domain</span> <span style="color: #d3869b;">T</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">FOL.Form</span>
  <span style="color: #d3869b;">Domain</span> <span style="color: #d3869b;">I</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">FOL.Form</span>]
  <span style="color: #d3869b;">Domain</span> <span style="color: #d3869b;">U</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Expr</span> <span style="color: #d3869b;">S</span>
  <span style="color: #d3869b;">Domain</span> <span style="color: #d3869b;">R</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Double</span>
  <span style="color: #d3869b;">Domain</span> (&#966; <span style="color: #d3869b;">:-&gt;</span> &#968;) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Domain</span> &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Domain</span> &#968;
  <span style="color: #d3869b;">Domain</span> (&#966; <span style="color: #d3869b;">:/\</span> &#968;) <span style="color: #83a598;">=</span> (<span style="color: #d3869b;">Domain</span> &#966;, <span style="color: #d3869b;">Domain</span> &#968;)
  <span style="color: #d3869b;">Domain</span> <span style="color: #d3869b;">Unit</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">()</span>
  <span style="color: #d3869b;">Domain</span> (<span style="color: #d3869b;">P</span> &#966;) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">ProbProg</span> (<span style="color: #d3869b;">Domain</span> &#966;)
</pre>
</div>
<p>
Crucially, we encode the type <code>R</code> of real numbers as the type <code>Double</code> in
Haskell. We also encode our newer type <code>I</code> of possible worlds as the type
<code>[FOL.Form]</code> of <i>lists of first-order formulae</i>. The idea behind this choice is
that the role of a possible world is just to settle what the facts of the
matter are, potentially about some domain. Thus any given possible world may
regarded as a <i>list</i> of facts (encoded as first-order formulae) which hold at
that world.
</p>

<p>
As for the type of probabilistic programs, we rely on a new type constructor
<code>ProbProg</code>. Following ideas in <a href="../../readings/grove_probabilistic_2023.pdf">Grove and Bernardy 2023</a>, we can encode
probabilistic programs in Haskell by giving them a continuation semantics.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">newtype</span> <span style="color: #d3869b;">ProbProg</span> a <span style="color: #83a598;">=</span> <span style="color: #d3869b;">PP</span> { unPP <span style="color: #83a598;">::</span> (a <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Double</span>) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Double</span> }
</pre>
</div>
<p>
Specifically, any given probabilistic program that represents a probability
distribution over values of type \(α\) may be viewed as a function which takes
some <i>projection function</i> \(f : α → r\), in order to give back a real number.
Such a probabilistic program is therefore of type \((α → r) → r\). The idea is
that, given the projection function \(f\), \(m\) computes the expected value of
\(f\), given the distribution over values of type \(α\) that it represents.
</p>

<p>
Important for our interpretation is that <code>ProbProg</code> gives rise to a monad:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Monad</span> <span style="color: #d3869b;">ProbProg</span> <span style="color: #fb4933;">where</span>
  return a <span style="color: #83a598;">=</span> <span style="color: #d3869b;">PP</span> (<span style="color: #83a598;">\</span>f <span style="color: #83a598;">-&gt;</span> f a)
  <span style="color: #d3869b;">PP</span> m <span style="color: #83a598;">&gt;&gt;=</span> k <span style="color: #83a598;">=</span> <span style="color: #d3869b;">PP</span> (<span style="color: #83a598;">\</span>f <span style="color: #83a598;">-&gt;</span> m (<span style="color: #83a598;">\</span>x <span style="color: #83a598;">-&gt;</span> unPP (k x) f))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e0135a" class="outline-2">
<h2 id="org5e0135a"><span class="section-number-2">3.</span> The meaning of λ-calculus terms</h2>
<div class="outline-text-2" id="text-3">
<p>
Given this encoding encoding of types, we can begin assigning meanings to
terms of the λ-calculus representing probabilistic programs.
</p>
</div>

<div id="outline-container-org1661078" class="outline-3">
<h3 id="org1661078"><span class="section-number-3">3.1.</span> Constants</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Let's look at constants first.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpCon</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Constant</span> &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Domain</span> &#966;
<span style="color: #928374;">-- </span><span style="color: #928374;">First-order logic stuff</span>
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">C</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">FOL.N</span> (<span style="color: #d3869b;">FOL.Name</span> 0)
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">J</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">FOL.N</span> (<span style="color: #d3869b;">FOL.Name</span> 1)
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> (<span style="color: #d3869b;">ToReal</span> r) <span style="color: #83a598;">=</span> r
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">And</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>p q <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">FOL.And</span> p q
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Or</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>p q <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">FOL.Or</span> p q
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Imp</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>p q <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">FOL.Or</span> (<span style="color: #d3869b;">FOL.Not</span> p) (<span style="color: #d3869b;">FOL.Not</span> q)
<span style="color: #fabd2f;">interpCon</span> n <span style="color: #d3869b;">Forall</span> <span style="color: #83a598;">=</span>
  <span style="color: #83a598;">\</span>p <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">FOL.Forall</span> (<span style="color: #d3869b;">FOL.Var</span> n) (p (<span style="color: #d3869b;">FOL.V</span> (<span style="color: #d3869b;">FOL.Var</span> n)))
<span style="color: #fabd2f;">interpCon</span> n <span style="color: #d3869b;">Exists</span> <span style="color: #83a598;">=</span>
  <span style="color: #83a598;">\</span>p <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">FOL.Exists</span> (<span style="color: #d3869b;">FOL.Var</span> n) (p (<span style="color: #d3869b;">FOL.V</span> (<span style="color: #d3869b;">FOL.Var</span> n)))
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Not</span> <span style="color: #83a598;">=</span> <span style="color: #83a598;">\</span>p <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">FOL.Not</span> p
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Sleep</span> <span style="color: #83a598;">=</span> sleep
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Teach</span> <span style="color: #83a598;">=</span> teach
<span style="color: #928374;">-- </span><span style="color: #928374;">Probabilistic programming stuff</span>
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Indi</span> <span style="color: #83a598;">=</span> indi
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">ExpVal</span> <span style="color: #83a598;">=</span> expVal 
<span style="color: #fabd2f;">interpCon</span> <span style="color: #fb4933;">_</span> <span style="color: #d3869b;">Factor</span> <span style="color: #83a598;">=</span> factor
</pre>
</div>
<p>
The functions dedicated specifically to interpreting probabilistic programs
are <code>indi</code>, <code>expVal</code>, and <code>factor</code>. We define in the following way. Given a
formula, the indicator function checks that it is necessarily true; if so, it
returns 1, otherwise 0.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">indi</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">FOL.Form</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Double</span> <span style="color: #928374;">-- </span><span style="color: #928374;">i.e., Domain (T :-&gt; R)</span>
<span style="color: #fabd2f;">indi</span> &#966; <span style="color: #83a598;">=</span> <span style="color: #fb4933;">if</span> entails 11 <span style="color: #d3869b;">[]</span> &#966; <span style="color: #fb4933;">then</span> 1 <span style="color: #fb4933;">else</span> 0
</pre>
</div>
<p>
To compute the expected value of some projection function \(f\), given a
program \(m\), we feed \(f\) to \(m\) as its continuation, which gives us a
weighted average the results of applying \(f\) to the values returned by \(m\).
The relevant weights might not sum to 1, however, so we divide \(m(f)\) by
\(m(λb.1)\). This latter quantity represents the entire mass assigned by \(m\) to
the values it returns; i.e., it is the sum of all of its weights.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">expVal</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">ProbProg</span> &#945; <span style="color: #83a598;">-&gt;</span> (&#945; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Double</span>) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Double</span> <span style="color: #928374;">-- </span><span style="color: #928374;">i.e., Domain (P &#945; :-&gt; ((&#945; :-&gt; R) :-&gt; R))</span>
<span style="color: #fabd2f;">expVal</span> (<span style="color: #d3869b;">PP</span> m) f <span style="color: #83a598;">=</span> m f <span style="color: #83a598;">/</span> f (<span style="color: #83a598;">\</span>b <span style="color: #83a598;">-&gt;</span> 1)
</pre>
</div>
<p>
<code>factor</code> is defined as a program which simply factors the result of its
continuation by some weight.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">factor</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Double</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">ProbProg</span> <span style="color: #d3869b;">()</span>
<span style="color: #fabd2f;">factor</span> r <span style="color: #83a598;">=</span> <span style="color: #d3869b;">PP</span> (<span style="color: #83a598;">\</span>f <span style="color: #83a598;">-&gt;</span> r <span style="color: #83a598;">*</span> f <span style="color: #d3869b;">()</span>)
</pre>
</div>
<p>
When <code>factor r</code> is sequenced with some other program, that program effectively
acts as its continuation. Thus whatever weight the program is assigned in the
broader context, this weight is now also scaled by <code>r</code>.
</p>
</div>
</div>

<div id="outline-container-org2a60a84" class="outline-3">
<h3 id="org2a60a84"><span class="section-number-3">3.2.</span> Monadic constructors</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Let's now interpret our monadic constructors <code>Return</code> and <code>Let</code>. <code>Return</code> gets
interpreted as&#x2014;you guessed it&#x2014;the <code>return</code> of the monad <code>ProbProg</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpTerm</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> (<span style="color: #fb4933;">forall</span> &#966;<span style="color: #83a598;">.</span><span style="color: #d3869b;">In</span> &#966; &#947; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Domain</span> &#966;) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; &#968; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Domain</span> &#968;
<span style="color: #fabd2f;">interpTerm</span> n g (<span style="color: #d3869b;">Return</span> t) <span style="color: #83a598;">=</span> return (interpTerm n g t)
</pre>
</div>
<p>
Meanwhile, <code>Let</code> is interpreted using the bind of the same monad.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpTerm</span> n g (<span style="color: #d3869b;">Let</span> t u) <span style="color: #83a598;">=</span>
<span style="color: #fabd2f;">interpTerm</span> n g t <span style="color: #83a598;">&gt;&gt;=</span> <span style="color: #83a598;">\</span>x <span style="color: #83a598;">-&gt;</span> interpTerm n (<span style="color: #83a598;">\</span>i <span style="color: #83a598;">-&gt;</span> <span style="color: #fb4933;">case</span> i <span style="color: #fb4933;">of</span> <span style="color: #d3869b;">First</span> <span style="color: #83a598;">-&gt;</span> x; <span style="color: #d3869b;">Next</span> j <span style="color: #83a598;">-&gt;</span> g j) u
</pre>
</div>
<p>
Notice our use of variable assignments (things of type <code>forall φ.In φ γ -&gt;
   Domain φ</code>) here, which is analogous to how we use them when we interpret
λ-terms built using the <code>Lam</code> constructor.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpTerm</span> n <span style="color: #fb4933;">_</span> (<span style="color: #d3869b;">Con</span> c) <span style="color: #83a598;">=</span> interpCon n c
<span style="color: #fabd2f;">interpTerm</span> <span style="color: #fb4933;">_</span> g (<span style="color: #d3869b;">Var</span> v) <span style="color: #83a598;">=</span> g v
<span style="color: #fabd2f;">interpTerm</span> n g (<span style="color: #d3869b;">App</span> t u) <span style="color: #83a598;">=</span> interpTerm (succ n) g t (interpTerm (succ n) g u)
<span style="color: #fabd2f;">interpTerm</span> n g (<span style="color: #d3869b;">Lam</span> t) <span style="color: #83a598;">=</span>
  <span style="color: #83a598;">\</span>x <span style="color: #83a598;">-&gt;</span> interpTerm n (<span style="color: #83a598;">\</span>i <span style="color: #83a598;">-&gt;</span> <span style="color: #fb4933;">case</span> i <span style="color: #fb4933;">of</span> <span style="color: #d3869b;">First</span> <span style="color: #83a598;">-&gt;</span> x; <span style="color: #d3869b;">Next</span> j <span style="color: #83a598;">-&gt;</span> g j) t   
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-12-12 Tue 17:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
